app/controllers/addresses_controller.rb

  def create
    @address = Address.new(address_params)
    @address.save
---
INSERT INTO "addresses" ("address1", "address2", "city", "companyName", "country", "created_at", "email", "name", "state", "updated_at", "zip_code") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def set_address
      @address = Address.find(params[:id])
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT 1  [["id", "1"]]