app/controllers/users_controller.rb

  def index
    if params[:approved] == "false"
      @users = User.find_all_by_approved(false)
    else
      @users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."approved" = 'f'
SELECT "users".* FROM "users"

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(set_user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "3"]]
UPDATE "users" SET "firstName" = $1, "middleName" = $2, "lastName" = $3, "contact1" = $4, "contact2" = $5, "updated_at" = $6 WHERE "users"."id" = 3  [["firstName", "Pratik"], ["middleName", "S"], ["lastName", "Panchal"], ["contact1", "987456321"], ["contact2", "1236547892"], ["updated_at", Sat, 19 Sep 2015 05:19:09 UTC +00:00]]

  def change_password
    @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 ORDER BY "users"."id" ASC LIMIT 1

  def approve_user
    @user = User.find(params[:id])
    @user.approved = true
    @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "4"]]
UPDATE "users" SET "approved" = $1, "updated_at" = $2 WHERE "users"."id" = 4  [["approved", true], ["updated_at", Mon, 14 Sep 2015 13:02:04 UTC +00:00]]